/* The string for canceling a map editing function. */
"CancelKey" = "Cancel";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "Are you sure you want to cancel?";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "Your changes will not be saved.";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "The object you created will not be saved.";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "Discard Changes";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "Cancel Editing";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "Invalid Address";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "An address must be included for the point";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "You have not added a location for this point";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "No new point will be added";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "Continue Editing";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "Select the point you want to delete.";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "There are no points to delete.";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "OK";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "Are you sure you want to clear all points?";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "No";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "Yes";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "Do you want to switch to a point?";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "Do you want to switch to a polyline?";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "Do you want to switch to a polygon?";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "The points you added will not be changed and you can continue creating the object";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "All your added points will be deleted";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "Are you sure you want to delete this point?";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "Save";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "Filter";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "Current Location";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "No suggestions found";

/* The text of the editingPanel Address textField. */
"AddressKey" = "Address";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "Clear All";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "%@ Created Successfully";

/* The placeholder text of the Searchbar */
"SearchKey" = "Search";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "Add New Point";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "Basemap";

/* The title for the standard map type. */
"StandardKey" = "Standard";

/* The title for the hybrid map type. */
"HybridKey" = "Hybrid";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "Hybrid Flyover";

/* The title for the muted standard map type. */
"MutedStandardKey" = "Muted Standard";

/* The title for the satellite map type. */
"SatelliteKey" = "Satellite";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "Satellite Flyover";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "Add Location";

